uhnp/src/InformationRegisters/ОбработанныеОбъектыБД/ОбработанныеОбъектыБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбработанныеОбъектыБД</name>
  <resources>
    <name>ИсходныйОбъектНомер</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсходныйОбъектНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсходныйОбъектДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсходныйОбъектКод</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбработкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>СеансОбменаДанными</name>
    <type>
      <types>CatalogRef.СеансыОбменаДанными</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсходныйОбъектСсылка</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбработанныйОбъектСсылка</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПротоколыОбъектов/ПротоколыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколыОбъектов</name>
  <resources>
    <name>Протокол</name>
    <type>
      <types>CatalogRef.ПротоколируемыеСобытия</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.КорректировкаЗначенийПоказателей</types>
      <types>CatalogRef.ГруппыРаскрытия</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
      <types>CatalogRef.ПараметрыОбменаНСИ</types>
      <types>DocumentRef.НастраиваемыйОтчет</types>
      <types>CatalogRef.СеансыОбменаДанными</types>
      <types>CatalogRef.ПакетыПравилИмпортаТаблиц</types>
      <types>CatalogRef.ХранимыеФайлыОрганизацийПрисоединенныеФайлы</types>
      <types>CatalogRef.СтрокиОтчетов</types>
      <types>DocumentRef.Элиминация</types>
      <types>CatalogRef.ПоказателиОтчетов</types>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьВерсияХранимогоФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ШаблоныТрансформационныхКорректировок</types>
      <types>CatalogRef.ШаблоныТрансляций</types>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипыСобытийОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияХранимогоФайла</name>
    <type>
      <types>CatalogRef.ХранимыеФайлыОрганизацийПрисоединенныеФайлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ПравилаЗаполненияОбъектовБД/ПравилаЗаполненияОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаЗаполненияОбъектовБД</name>
  <owners>Catalog.ДокументыБД</owners>
  <owners>Catalog.СправочникиБД</owners>
  <attributes>
    <name>ТипБД</name>
    <type>
      <types>CatalogRef.ТипыБазДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДляЗаполненияШапки</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйОбъектБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерииПоУмолчанию</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистраПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоОбъектуБД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовПоУмолчанию</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцедураЗаполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодПослеЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсточникиДляЗаполненияТЧ</name>
    <attributes>
      <name>ТабличнаяЧасть</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыШапкиДляСинхронизацииТЧ</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеРеквизитыКонтекстаЗагрузки</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСоответствияРеквизитов</name>
    <attributes>
      <name>РасположениеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСоответствия</name>
      <type>
        <types>CatalogRef.СоответствиеВнешнимИБ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/СеансыОбменаДанными/СеансыОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СеансыОбменаДанными</name>
  <attributes>
    <name>ОбъектБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЗаполнения</name>
    <type>
      <types>CatalogRef.ПравилаЗаполненияОбъектовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьГенерации</name>
    <type>
      <types>EnumRef.ОбластиГенерацииОбъектов</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ОбработанныеОбъектыБД/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ИсходныйОбъектСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.ИсходныйОбъектСсылка) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Запись.ИсходныйОбъектСсылка)=Тип("Строка") Тогда
		
		СтруктураПараметров=ПолучитьДанныеОбъектаВИБ(Запись.ИсходныйОбъектСсылка,Запись);
		
		Если ТипЗнч(СтруктураПараметров)=Тип("Структура") Тогда
			
			ОткрытьФорму("ОбщаяФорма.ОтображениеЭлементаWS_Управляемая", Новый Структура("Расшифровка, ИспользуемаяИБ", СтруктураПараметров, ИспользуемаяИБ));
			
		КонецЕсли;
		
	Иначе
		
		ПоказатьЗначение(, Запись.ИсходныйОбъектСсылка);
		
	КонецЕсли;
		
КонецПроцедуры



&НаСервере
Функция ПолучитьДанныеОбъектаВИБ(СтрокаGUID, ЗНАЧ Запись)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ПравилаЗаполненияОбъектовБД.ИсходныйОбъектБД.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПравилаЗаполненияОбъектовБД КАК ПравилаЗаполненияОбъектовБД
	|ГДЕ
	|	ПравилаЗаполненияОбъектовБД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ПолучитьРеквизитСеанса(Запись.СеансОбменаДанными,"ПравилоЗаполнения"));
	
	Результат=Запрос.Выполнить().Выбрать();
	Результат.Следующий();
		
	СтруктураОбъекта=Новый Структура("ТипЗначения, Значение", "ДокументСсылка."+Результат.Наименование,СтрокаGUID);
	
	Возврат СтруктураОбъекта;			

КонецФункции // ПолучитьДанныеОбъектаВИБ()

&НаСервереБезКонтекста
Функция ПолучитьРеквизитСеанса(СеансОбменаДанными,ИмяРеквизита)
	
	Возврат СеансОбменаДанными[ИмяРеквизита];	
	
КонецФункции // ПолучитьРеквизитСеанса()

&НаКлиенте
Процедура ОбработанныйОбъектСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.ОбработанныйОбъектСсылка) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Запись.ОбработанныйОбъектСсылка)=Тип("Строка") Тогда
		
		СтруктураПараметров=ПолучитьДанныеОбъектаВИБ(Запись.ОбработанныйОбъектСсылка,Запись);
		
		Если ТипЗнч(СтруктураПараметров)=Тип("Структура") Тогда
			
			ОткрытьФорму("ОбщаяФорма.ОтображениеЭлементаWS_Управляемая", Новый Структура("Расшифровка, ИспользуемаяИБ", СтруктураПараметров, ИспользуемаяИБ));
			
		КонецЕсли;
		
	Иначе
		
		ПоказатьЗначение(, Запись.ОбработанныйОбъектСсылка);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемаяИБПриИзменении(Элемент)
	
	ИспользуемаяИБПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемаяИБПриИзмененииНаСервере()
	
	ТипБД=ИспользуемаяИБ.ТипБД;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СеансыОбменаДанными.ОбъектБД,
	|	СеансыОбменаДанными.ИспользуемаяИБ,
	|	СеансыОбменаДанными.ПравилоЗаполнения,
	|	СеансыОбменаДанными.ОбластьГенерации,
	|	СеансыОбменаДанными.Организация,
	|	СеансыОбменаДанными.ПериодОтчета,
	|	ЕСТЬNULL(ПротоколыОбъектов.Протокол, НЕОПРЕДЕЛЕНО) КАК ПротоколОбмена,
	|	ЕСТЬNULL(ПротоколыОбъектов.ЕстьОшибки, ЛОЖЬ) КАК ЕстьОшибки
	|ИЗ
	|	Справочник.СеансыОбменаДанными КАК СеансыОбменаДанными
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколыОбъектов КАК ПротоколыОбъектов
	|		ПО СеансыОбменаДанными.Ссылка = ПротоколыОбъектов.Объект
	|ГДЕ
	|	СеансыОбменаДанными.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Запись.СеансОбменаДанными);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		ОбъектБД			= Результат.ОбъектБД;
		ИспользуемаяИБ		= Результат.ИспользуемаяИБ;
		ПравилоЗаполнения	= Результат.ПравилоЗаполнения;
		ОбластьГенерации	= Результат.ОбластьГенерации;
		Организация			= Результат.Организация;
		ПериодОтчета		= Результат.ПериодОтчета;
		ПротоколОбмена		= Результат.ПротоколОбмена;
		ЕстьОшибки			= Результат.ЕстьОшибки;
		
	КонецЕсли;
	
	Элементы.ОтобразитьПротокол.Видимость=ЗначениеЗаполнено(ПротоколОбмена);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивПротоколируемыхОбъектов(СеансОбменаДанными)
	
	МассивОбъектов=Новый Массив;
	МассивОбъектов.Добавить(СеансОбменаДанными);
	
	Возврат ПротоколируемыеСобытияУХ.ПолучитьМассивПротоколируемыхОбъектов(МассивОбъектов);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонтекстОбъекта(СеансОбменаДанными)
	
	Возврат ПротоколируемыеСобытияУХ.ПолучитьСтруктуруКонтекста(СеансОбменаДанными);	
	
КонецФункции


&НаКлиенте
Процедура ОтобразитьПротокол(Команда)
	
	МассивПротоколируемыхОбъектов=ПолучитьМассивПротоколируемыхОбъектов(Запись.СеансОбменаДанными);
	
	Если МассивПротоколируемыхОбъектов.Количество()>0 Тогда
		
		ОткрытьФорму("Обработка.ОтображениеПротоколируемыхСобытий.Форма.Форма",Новый Структура("МассивПротоколируемыхОбъектов",МассивПротоколируемыхОбъектов));
		
	Иначе
		
		ОткрытьФорму("Обработка.ОтображениеПротоколируемыхСобытий.Форма.Форма",Новый Структура("КонтекстПротокола",ПолучитьКонтекстОбъекта(Запись.СеансОбменаДанными)));
		
	КонецЕсли;
	
КонецПроцедуры
